while True: #цикл на случай, что введут не целое число, число меньше 2, не число вообще. пока не введут нужное, цикл будет снова просить ввести число (капец крутая)
    number = input('Введите целое число N (больше или равно 2): ')
    if number.isdigit() and int(number) >= 2: #проверка на то, что это целое число И на то, что оно >=2
        break
n = int(number)
print('Простые числа от 2 до', n, ':')

for num in range(2, n + 1): #начинается цикл по всем числам от 2 до n включительно. range(2, n + 1) создаёт последовательность 2, 3, 4, ..., n. num — текущее проверяемое число
    divider = 2 #делитель, начинаем с 2. Для каждого нового num (то есть для каждого проверяемого числа) divider сбрасывается обратно в 2
    while divider**2 <= num: #Проверяй делители до тех пор, пока divider не превысит квадратный корень из num
        if num % divider == 0: #Проверяем, делится ли primes на num без остатка. Если остаток 0, число делится
            break
        divider += 1 #Если num % divider != 0, то есть число не делится на текущий divider, break не срабатывает. Тогда выполняется divider += 1, и мы переходим к следующему делителю
    else:
        print(num)
